; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f7-p21-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 
             p20 - passenger
             f0 f1 f2 f3 f4 f5 f6 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)

(above f3 f4)
(above f3 f5)
(above f3 f6)

(above f4 f5)
(above f4 f6)

(above f5 f6)



(origin p0 f1)
(destin p0 f2)

(origin p1 f2)
(destin p1 f6)

(origin p2 f0)
(destin p2 f4)

(origin p3 f1)
(destin p3 f0)

(origin p4 f6)
(destin p4 f3)

(origin p5 f5)
(destin p5 f6)

(origin p6 f0)
(destin p6 f3)

(origin p7 f5)
(destin p7 f3)

(origin p8 f3)
(destin p8 f2)

(origin p9 f4)
(destin p9 f6)

(origin p10 f6)
(destin p10 f2)

(origin p11 f0)
(destin p11 f6)

(origin p12 f3)
(destin p12 f1)

(origin p13 f5)
(destin p13 f4)

(origin p14 f2)
(destin p14 f4)

(origin p15 f5)
(destin p15 f2)

(origin p16 f0)
(destin p16 f3)

(origin p17 f3)
(destin p17 f4)

(origin p18 f2)
(destin p18 f1)

(origin p19 f3)
(destin p19 f5)

(origin p20 f4)
(destin p20 f1)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
(served p13)
(served p14)
(served p15)
(served p16)
(served p17)
(served p18)
(served p19)
(served p20)
))
)

; plan
1. (board f0 p2)
   added: (boarded p2)
   goals met: 0 of 21
2. (board f0 p11)
   added: (boarded p11)
   goals met: 0 of 21
3. (up f0 f3)
   deleted: (lift-at f0)
   added: (lift-at f3)
   goals met: 0 of 21
4. (board f3 p8)
   added: (boarded p8)
   goals met: 0 of 21
5. (board f3 p19)
   added: (boarded p19)
   goals met: 0 of 21
6. (board f3 p17)
   added: (boarded p17)
   goals met: 0 of 21
7. (board f3 p12)
   added: (boarded p12)
   goals met: 0 of 21
8. (up f3 f5)
   deleted: (lift-at f3)
   added: (lift-at f5)
   goals met: 0 of 21
9. (depart f5 p19)
   deleted: (boarded p19)
   added: (served p19)
   goals met: 1 of 21
10. (board f5 p7)
   added: (boarded p7)
   goals met: 1 of 21
11. (board f5 p5)
   added: (boarded p5)
   goals met: 1 of 21
12. (board f5 p15)
   added: (boarded p15)
   goals met: 1 of 21
13. (board f5 p13)
   added: (boarded p13)
   goals met: 1 of 21
14. (down f5 f2)
   deleted: (lift-at f5)
   added: (lift-at f2)
   goals met: 1 of 21
15. (depart f2 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 2 of 21
16. (depart f2 p15)
   deleted: (boarded p15)
   added: (served p15)
   goals met: 3 of 21
17. (board f2 p18)
   added: (boarded p18)
   goals met: 3 of 21
18. (board f2 p14)
   added: (boarded p14)
   goals met: 3 of 21
19. (board f2 p1)
   added: (boarded p1)
   goals met: 3 of 21
20. (up f2 f4)
   deleted: (lift-at f2)
   added: (lift-at f4)
   goals met: 3 of 21
21. (board f4 p20)
   added: (boarded p20)
   goals met: 3 of 21
22. (board f4 p9)
   added: (boarded p9)
   goals met: 3 of 21
23. (depart f4 p13)
   deleted: (boarded p13)
   added: (served p13)
   goals met: 4 of 21
24. (depart f4 p14)
   deleted: (boarded p14)
   added: (served p14)
   goals met: 5 of 21
25. (depart f4 p17)
   deleted: (boarded p17)
   added: (served p17)
   goals met: 6 of 21
26. (depart f4 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 7 of 21
27. (down f4 f1)
   deleted: (lift-at f4)
   added: (lift-at f1)
   goals met: 7 of 21
28. (board f1 p0)
   added: (boarded p0)
   goals met: 7 of 21
29. (board f1 p3)
   added: (boarded p3)
   goals met: 7 of 21
30. (depart f1 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 8 of 21
31. (depart f1 p18)
   deleted: (boarded p18)
   added: (served p18)
   goals met: 9 of 21
32. (depart f1 p20)
   deleted: (boarded p20)
   added: (served p20)
   goals met: 10 of 21
33. (down f1 f0)
   deleted: (lift-at f1)
   added: (lift-at f0)
   goals met: 10 of 21
34. (board f0 p16)
   added: (boarded p16)
   goals met: 10 of 21
35. (board f0 p6)
   added: (boarded p6)
   goals met: 10 of 21
36. (depart f0 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 11 of 21
37. (up f0 f6)
   deleted: (lift-at f0)
   added: (lift-at f6)
   goals met: 11 of 21
38. (board f6 p10)
   added: (boarded p10)
   goals met: 11 of 21
39. (board f6 p4)
   added: (boarded p4)
   goals met: 11 of 21
40. (depart f6 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 12 of 21
41. (depart f6 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 13 of 21
42. (depart f6 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 14 of 21
43. (depart f6 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 15 of 21
44. (down f6 f2)
   deleted: (lift-at f6)
   added: (lift-at f2)
   goals met: 15 of 21
45. (depart f2 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 16 of 21
46. (depart f2 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 17 of 21
47. (up f2 f3)
   deleted: (lift-at f2)
   added: (lift-at f3)
   goals met: 17 of 21
48. (depart f3 p16)
   deleted: (boarded p16)
   added: (served p16)
   goals met: 18 of 21
49. (depart f3 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 19 of 21
50. (depart f3 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 20 of 21
51. (depart f3 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 21 of 21
